# Задание 2.
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]

list_0 = [2,3,4,5,6]
def mult(list_0):
    mult = []
    for i in range((len(list_0)+1)//2):
        mult.append(list_0[i]*list_0[len(list_0)-1-i])
    return mult
print(list_0, ' => ', mult(list_0))